ee230/C8051F/Examples/C8051F04x/Header_Files/c8051F040_defs.h
//-----------------------------------------------------------------------------
// C8051F040_defs.h
//-----------------------------------------------------------------------------
// Copyright 2008 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// Register/bit definitions for the C8051F04x/'F04x family.
// **Important Note**: The compiler_defs.h header file should be included
// before including this header file.
//
// Target:         C8051F04x, 'F04x
// Tool chain:     Keil
// Command Line:   None
//
// Release 1.4 - 22 July 2008 (ES)
//    -Updated SCON1, IP, ADC0CN, ADC2CN bit definitions
// Release 1.3
//    -29 FEB 2008
//    -Made compiler independant by AS
//    -Added 16-bit sfr definitions
//
//-----------------------------------------------------------------------------
// Header File Preprocessor Directive
//-----------------------------------------------------------------------------

#ifndef C8051F040_DEFS_H
#define C8051F040_DEFS_H

//-----------------------------------------------------------------------------
// Byte Registers
//-----------------------------------------------------------------------------

SFR (P0, 0x80);           // PORT 0
SFR (SP, 0x81);           // STACK POINTER
SFR (DPL, 0x82);          // DATA POINTER - LOW BYTE
SFR (DPH, 0x83);          // DATA POINTER - HIGH BYTE
SFR (SFRPAGE, 0x84);      // SFR PAGE SELECT
SFR (SFRNEXT, 0x85);      // SFR STACK NEXT PAGE
SFR (SFRLAST, 0x86);      // SFR STACK LAST PAGE
SFR (PCON, 0x87);         // POWER CONTROL
SFR (TCON, 0x88);         // TIMER CONTROL
SFR (CPT0CN, 0x88);       // COMPARATOR 0 CONTROL
SFR (CPT1CN, 0x88);       // COMPARATOR 1 CONTROL
SFR (CPT2CN, 0x88);       // COMPARATOR 2 CONTROL
SFR (TMOD, 0x89);         // TIMER MODE
SFR (CPT0MD, 0x89);       // COMPARATOR 0 MODE
SFR (CPT1MD, 0x89);       // COMPARATOR 1 MODE
SFR (CPT2MD, 0x89);       // COMPARATOR 2 MODE
SFR (TL0, 0x8A);          // TIMER 0 - LOW BYTE
SFR (OSCICN, 0x8A);       // INTERNAL OSCILLATOR CONTROL
SFR (TL1, 0x8B);          // TIMER 1 - LOW BYTE
SFR (OSCICL, 0x8B);       // INTERNAL OSCILLATOR CALIBRATION
SFR (TH0, 0x8C);          // TIMER 0 - HIGH BYTE
SFR (OSCXCN, 0x8C);       // EXTERNAL OSCILLATOR CONTROL
SFR (TH1, 0x8D);          // TIMER 1 - HIGH BYTE
SFR (CKCON, 0x8E);        // TIMER 0/1 CLOCK CONTROL
SFR (PSCTL, 0x8F);        // FLASH WRITE/ERASE CONTROL
SFR (P1, 0x90);           // PORT 1
SFR (SSTA0, 0x91);        // UART 0 STATUS
SFR (SFRPGCN, 0x96);      // SFR PAGE CONTROL
SFR (CLKSEL, 0x97);       // SYSTEM CLOCK SELECT
SFR (SCON0, 0x98);        // UART 0 CONTROL
SFR (SCON1, 0x98);        // UART 1 CONTROL
SFR (SBUF0, 0x99);        // UART 0 BUFFER
SFR (SBUF1, 0x99);        // UART 1 BUFFER
SFR (SPI0CFG, 0x9A);      // SPI 0 CONFIGURATION
SFR (SPI0DAT, 0x9B);      // SPI 0 DATA
SFR (P4MDOUT, 0x9C);      // PORT 4 OUTPUT MODE
SFR (SPI0CKR, 0x9D);      // SPI 0 CLOCK RATE CONTROL
SFR (P5MDOUT, 0x9D);      // PORT 5 OUTPUT MODE
SFR (P6MDOUT, 0x9E);      // PORT 6 OUTPUT MODE
SFR (P7MDOUT, 0x9F);      // PORT 7 OUTPUT MODE
SFR (P2, 0xA0);           // PORT 2
SFR (EMI0TC, 0xA1);       // EMIF TIMING CONTROL
SFR (EMI0CN, 0xA2);       // EMIF CONTROL
SFR (EMI0CF, 0xA3);       // EMIF CONFIGURATION
SFR (P0MDOUT, 0xA4);      // PORT 0 OUTPUT MODE
SFR (P1MDOUT, 0xA5);      // PORT 1 OUTPUT MODE
SFR (P2MDOUT, 0xA6);      // PORT 2 OUTPUT MODE CONFIGURATION
SFR (P3MDOUT, 0xA7);      // PORT 3 OUTPUT MODE CONFIGURATION
SFR (IE, 0xA8);           // INTERRUPT ENABLE
SFR (SADDR0, 0xA9);       // UART 0 SLAVE ADDRESS
SFR (SADDR1, 0xA9);       // UART 1 SLAVE ADDRESS
SFR (P1MDIN, 0xAD);       // PORT 1 INPUT MODE
SFR (P2MDIN, 0xAE);       // PORT 2 INPUT MODE
SFR (P3MDIN, 0xAF);       // PORT 3 INPUT MODE
SFR (P3, 0xB0);           // PORT 3
SFR (FLSCL, 0xB7);        // FLASH TIMING PRESCALAR
SFR (FLACL, 0xB7);        // FLASH ACCESS LIMIT
SFR (IP, 0xB8);           // INTERRUPT PRIORITY
SFR (SADEN0, 0xB9);       // UART 0 SLAVE ADDRESS MASK
SFR (AMX2CF, 0xBA);       // ADC 2 MUX CONFIGURATION
SFR (AMX0PRT, 0xBD);      // ADC 0 MUX PORT PIN SELECT REGISTER
SFR (AMX0CF, 0xBA);       // ADC 0 CONFIGURATION REGISTER
SFR (AMX0SL, 0xBB);       // ADC 0 AND ADC 1 MODE SELECTION
SFR (AMX2SL, 0xBB);       // ADC 2 MUX CHANNEL SELECTION
SFR (ADC0CF, 0xBC);       // ADC 0 CONFIGURATION
SFR (ADC2CF, 0xBC);       // ADC 2 CONFIGURATION
SFR (ADC0L, 0xBE);        // ADC 0 DATA - LOW BYTE
SFR (ADC2, 0xBE);         // ADC 2 DATA - LOW BYTE
SFR (ADC0H, 0xBF);        // ADC 0 DATA - HIGH BYTE
SFR (SMB0CN, 0xC0);       // SMBUS 0 CONTROL
SFR (CAN0STA, 0xC0);      // CAN 0 STATUS
SFR (SMB0STA, 0xC1);      // SMBUS 0 STATUS
SFR (SMB0DAT, 0xC2);      // SMBUS 0 DATA
SFR (SMB0ADR, 0xC3);      // SMBUS 0 SLAVE ADDRESS
SFR (ADC0GTL, 0xC4);      // ADC 0 GREATER-THAN REGISTER - LOW BYTE
SFR (ADC2GT, 0xC4);       // ADC 2 GREATER-THAN REGISTER - LOW BYTE
SFR (ADC0GTH, 0xC5);      // ADC 0 GREATER-THAN REGISTER - HIGH BYTE
SFR (ADC0LTL, 0xC6);      // ADC 0 LESS-THAN REGISTER - LOW BYTE
SFR (ADC2LT, 0xC6);       // ADC 2 LESS-THAN REGISTER - LOW BYTE
SFR (ADC0LTH, 0xC7);      // ADC 0 LESS-THAN REGISTER - HIGH BYTE
SFR (TMR2CN, 0xC8);       // TIMER 2 CONTROL
SFR (TMR3CN, 0xC8);       // TIMER 3 CONTROL
SFR (TMR4CN, 0xC8);       // TIMER 4 CONTROL
SFR (P4, 0xC8);           // PORT 4
SFR (TMR2CF, 0xC9);       // TIMER 2 CONFIGURATION
SFR (TMR3CF, 0xC9);       // TIMER 3 CONFIGURATION
SFR (TMR4CF, 0xC9);       // TIMER 4 CONFIGURATION
SFR (RCAP2L, 0xCA);       // TIMER 2 CAPTURE REGISTER - LOW BYTE
SFR (RCAP3L, 0xCA);       // TIMER 3 CAPTURE REGISTER - LOW BYTE
SFR (RCAP4L, 0xCA);       // TIMER 4 CAPTURE REGISTER - LOW BYTE
SFR (RCAP2H, 0xCB);       // TIMER 2 CAPTURE REGISTER - HIGH BYTE
SFR (RCAP3H, 0xCB);       // TIMER 3 CAPTURE REGISTER - HIGH BYTE
SFR (RCAP4H, 0xCB);       // TIMER 4 CAPTURE REGISTER - HIGH BYTE
SFR (TMR2L, 0xCC);        // TIMER 2 - LOW BYTE
SFR (TMR3L, 0xCC);        // TIMER 3 - LOW BYTE
SFR (TMR4L, 0xCC);        // TIMER 4 - LOW BYTE
SFR (TMR2H, 0xCD);        // TIMER 2 - HIGH BYTE
SFR (TMR3H, 0xCD);        // TIMER 3 - HIGH BYTE
SFR (TMR4H, 0xCD);        // TIMER 4 - HIGH BYTE
SFR (SMB0CR, 0xCF);       // SMBUS 0 CLOCK RATE
SFR (PSW, 0xD0);          // PROGRAM STATUS WORD
SFR (REF0CN, 0xD1);       // VOLTAGE REFERENCE 0 CONTROL
SFR (DAC0L, 0xD2);        // DAC 0 REGISTER - LOW BYTE
SFR (DAC1L, 0xD2);        // DAC 1 REGISTER - LOW BYTE
SFR (DAC0H, 0xD3);        // DAC 0 REGISTER - HIGH BYTE
SFR (DAC1H, 0xD3);        // DAC 1 REGISTER - HIGH BYTE
SFR (DAC0CN, 0xD4);       // DAC 0 CONTROL
SFR (DAC1CN, 0xD4);       // DAC 1 CONTROL
SFR (HVA0CN, 0xD6);       // HVDA CONTROL REGISTER
SFR (PCA0CN, 0xD8);       // PCA 0 COUNTER CONTROL
SFR (CAN0DATL, 0xD8);     // CAN 0 DATA - LOW BYTE
SFR (P5, 0xD8);           // PORT 5
SFR (PCA0MD, 0xD9);       // PCA 0 COUNTER MODE
SFR (CAN0DATH, 0xD9);     // CAN 0 DATA - HIGH BYTE
SFR (PCA0CPM0, 0xDA);     // PCA 0 MODULE 0 CONTROL
SFR (CAN0ADR, 0xDA);      // CAN 0 ADDRESS
SFR (PCA0CPM1, 0xDB);     // PCA 0 MODULE 1 CONTROL
SFR (CAN0TST, 0xDB);      // CAN 0 TEST
SFR (PCA0CPM2, 0xDC);     // PCA 0 MODULE 2 CONTROL
SFR (PCA0CPM3, 0xDD);     // PCA 0 MODULE 3 CONTROL
SFR (PCA0CPM4, 0xDE);     // PCA 0 MODULE 4 CONTROL
SFR (PCA0CPM5, 0xDF);     // PCA 0 MODULE 5 CONTROL
SFR (ACC, 0xE0);          // ACCUMULATOR
SFR (PCA0CPL5, 0xE1);     // PCA 0 MODULE 5 CAPTURE/COMPARE - LOW BYTE
SFR (XBR0, 0xE1);         // CROSSBAR CONFIGURATION REGISTER 0
SFR (PCA0CPH5, 0xE2);     // PCA 0 MODULE 5 CAPTURE/COMPARE - HIGH BYTE
SFR (XBR1, 0xE2);         // CROSSBAR CONFIGURATION REGISTER 1
SFR (XBR2, 0xE3);         // CROSSBAR CONFIGURATION REGISTER 2
SFR (XBR3, 0xE4);         // CROSSBAR CONFIGURATION REGISTER 3
SFR (EIE1, 0xE6);         // EXTERNAL INTERRUPT ENABLE 1
SFR (EIE2, 0xE7);         // EXTERNAL INTERRUPT ENABLE 2
SFR (ADC0CN, 0xE8);       // ADC 0 CONTROL
SFR (ADC2CN, 0xE8);       // ADC 2 CONTROL
SFR (P6, 0xE8);           // PORT 6
SFR (PCA0CPL2, 0xE9);     // PCA 0 MODULE 2 CAPTURE/COMPARE - LOW BYTE
SFR (PCA0CPH2, 0xEA);     // PCA 0 MODULE 2 CAPTURE/COMPARE - HIGH BYTE
SFR (PCA0CPL3, 0xEB);     // PCA 0 MODULE 3 CAPTURE/COMPARE - LOW BYTE
SFR (PCA0CPH3, 0xEC);     // PCA 0 MODULE 3 CAPTURE/COMPARE - HIGH BYTE
SFR (PCA0CPL4, 0xED);     // PCA 0 MODULE 4 CAPTURE/COMPARE - LOW BYTE
SFR (PCA0CPH4, 0xEE);     // PCA 0 MODULE 4 CAPTURE/COMPARE - HIGH BYTE
SFR (RSTSRC, 0xEF);       // RESET SOURCE
SFR (B, 0xF0);            // B REGISTER
SFR (EIP1, 0xF6);         // EXTERNAL INTERRUPT PRIORITY REGISTER 1
SFR (EIP2, 0xF7);         // EXTERNAL INTERRUPT PRIORITY REGISTER 2
SFR (SPI0CN, 0xF8);       // SPI 0 CONTROL
SFR (CAN0CN, 0xF8);       // CAN 0 CONTROL
SFR (P7, 0xF8);           // PORT 7
SFR (PCA0L, 0xF9);        // PCA 0 TIMER - LOW BYTE
SFR (PCA0H, 0xFA);        // PCA 0 TIMER - HIGH BYTE
SFR (PCA0CPL0, 0xFB);     // PCA 0 MODULE 0 CAPTURE/COMPARE - LOW BYTE
SFR (PCA0CPH0, 0xFC);     // PCA 0 MODULE 0 CAPTURE/COMPARE - HIGH BYTE
SFR (PCA0CPL1, 0xFD);     // PCA 0 MODULE 1 CAPTURE/COMPARE - LOW BYTE
SFR (PCA0CPH1, 0xFE);     // PCA 0 MODULE 1 CAPTURE/COMPARE - HIGH BYTE
SFR (WDTCN, 0xFF);        // WATCHDOG TIMER CONTROL

