ee230/C8051F/Examples/C8051F04x/Header_Files/c8051F040_defs.h
//-----------------------------------------------------------------------------
// 16-bit Register Definitions (might not be supported by all compilers)
//-----------------------------------------------------------------------------

SFR16(PCA0, 0xF9);        // PCA0 Counter
SFR16(PCA0CP0, 0xFB);     // PCA0 Module 0 Capture/Compare
SFR16(PCA0CP1, 0xFD);     // PCA0 Module 1 Capture/Compare
SFR16(PCA0CP2, 0xE9);     // PCA0 Module 2 Capture/Compare
SFR16(PCA0CP3, 0xEB);     // PCA0 Module 3 Capture/Compare
SFR16(PCA0CP4, 0xED);     // PCA0 Module 4 Capture/Compare
SFR16(PCA0CP5, 0xE1);     // PCA0 Module 5 Capture/Compare
SFR16(CAN0DAT, 0xD8);     // CAN 0 DATA
SFR16(DAC0, 0xD2);        // DAC 0 REGISTER
SFR16(DAC1, 0xD2);        // DAC 1 REGISTER
SFR16(RCAP2, 0xCA);       // TIMER 2 CAPTURE REGISTER
SFR16(RCAP3, 0xCA);       // TIMER 3 CAPTURE REGISTER
SFR16(RCAP4, 0xCA);       // TIMER 4 CAPTURE REGISTER
SFR16(TMR2, 0xCC);        // TIMER 2
SFR16(TMR3, 0xCC);        // TIMER 3
SFR16(TMR4, 0xCC);        // TIMER 4
SFR16(ADC0GT, 0xC4);      // ADC0 Greater-Than Compare
SFR16(ADC0LT, 0xC6);      // ADC0 Less-Than Compare
SFR16(ADC0, 0xBE);        // ADC0 Data
SFR16(DP, 0x82);          // Data Pointer

//-----------------------------------------------------------------------------
// Address Definitions for Bit-addressable Registers
//-----------------------------------------------------------------------------

#define SFR_P0      0x80
#define SFR_TCON    0x88
#define SFR_CPT0CN  0x88
#define SFR_CPT1CN  0x88
#define SFR_CPT2CN  0x88
#define SFR_P1      0x90
#define SFR_SCON0   0x98
#define SFR_SCON1   0x98
#define SFR_P2      0xA0
#define SFR_IE      0xA8
#define SFR_P3      0xB0
#define SFR_IP      0xB8
#define SFR_SMB0CN  0xC0
#define SFR_CAN0STA 0xC0
#define SFR_P4      0xC8
#define SFR_TMR2CN  0xC8
#define SFR_TMR3CN  0xC8
#define SFR_TMR4CN  0xC8
#define SFR_PSW     0xD0
#define SFR_P5      0xD8
#define SFR_PCA0CN  0xD8
#define SFR_ACC     0xE0
#define SFR_P6      0xE8
#define SFR_ADC0CN  0xE8
#define SFR_ADC2CN  0xE8
#define SFR_B       0xF0
#define SFR_SPI0CN  0xF8
#define SFR_CAN0CN  0xF8
#define SFR_P7      0xF8

//-----------------------------------------------------------------------------
// Bit Definitions
//-----------------------------------------------------------------------------

//  TCON  0x88
SBIT (TF1, SFR_TCON, 7);             // TIMER 1 OVERFLOW FLAG
SBIT (TR1, SFR_TCON, 6);             // TIMER 1 ON/OFF CONTROL
SBIT (TF0, SFR_TCON, 5);             // TIMER 0 OVERFLOW FLAG
SBIT (TR0, SFR_TCON, 4);             // TIMER 0 ON/OFF CONTROL
SBIT (IE1, SFR_TCON, 3);             // EXT. INTERRUPT 1 EDGE FLAG
SBIT (IT1, SFR_TCON, 2);             // EXT. INTERRUPT 1 TYPE
SBIT (IE0, SFR_TCON, 1);             // EXT. INTERRUPT 0 EDGE FLAG
SBIT (IT0, SFR_TCON, 0);             // EXT. INTERRUPT 0 TYPE

//  CPT0CN  0x88
SBIT (CP0EN, SFR_CPT0CN, 7);         // COMPARATOR 0 ENABLE
SBIT (CP0OUT, SFR_CPT0CN, 6);        // COMPARATOR 0 OUTPUT
SBIT (CP0RIF, SFR_CPT0CN, 5);        // COMPARATOR 0 RISING EDGE INTERRUPT
SBIT (CP0FIF, SFR_CPT0CN, 4);        // COMPARATOR 0 FALLING EDGE INTERRUPT
SBIT (CP0HYP1, SFR_CPT0CN, 3);       // COMPARATOR 0 POSITIVE HYSTERESIS 1
SBIT (CP0HYP0, SFR_CPT0CN, 2);       // COMPARATOR 0 POSITIVE HYSTERESIS 0
SBIT (CP0HYN1, SFR_CPT0CN, 1);       // COMPARATOR 0 NEGATIVE HYSTERESIS 1
SBIT (CP0HYN0, SFR_CPT0CN, 0);       // COMPARATOR 0 NEGATIVE HYSTERESIS 0

//  CPT1CN  0x88
SBIT (CP1EN, SFR_CPT1CN, 7);         // COMPARATOR 1 ENABLE
SBIT (CP1OUT, SFR_CPT1CN, 6);        // COMPARATOR 1 OUTPUT
SBIT (CP1RIF, SFR_CPT1CN, 5);        // COMPARATOR 1 RISING EDGE INTERRUPT
SBIT (CP1FIF, SFR_CPT1CN, 4);        // COMPARATOR 1 FALLING EDGE INTERRUPT
SBIT (CP1HYP1, SFR_CPT1CN, 3);       // COMPARATOR 1 POSITIVE HYSTERESIS 1
SBIT (CP1HYP0, SFR_CPT1CN, 2);       // COMPARATOR 1 POSITIVE HYSTERESIS 0
SBIT (CP1HYN1, SFR_CPT1CN, 1);       // COMPARATOR 1 NEGATIVE HYSTERESIS 1
SBIT (CP1HYN0, SFR_CPT1CN, 0);       // COMPARATOR 1 NEGATIVE HYSTERESIS 0

//  CPT2CN  0x88
SBIT (CP2EN, SFR_CPT2CN, 7);         // COMPARATOR 2 ENABLE
SBIT (CP2OUT, SFR_CPT2CN, 6);        // COMPARATOR 2 OUTPUT
SBIT (CP2RIF, SFR_CPT2CN, 5);        // COMPARATOR 2 RISING EDGE INTERRUPT
SBIT (CP2FIF, SFR_CPT2CN, 4);        // COMPARATOR 2 FALLING EDGE INTERRUPT
SBIT (CP2HYP1, SFR_CPT2CN, 3);       // COMPARATOR 2 POSITIVE HYSTERESIS 1
SBIT (CP2HYP0, SFR_CPT2CN, 2);       // COMPARATOR 2 POSITIVE HYSTERESIS 0
SBIT (CP2HYN1, SFR_CPT2CN, 1);       // COMPARATOR 2 NEGATIVE HYSTERESIS 1
SBIT (CP2HYN0, SFR_CPT2CN, 0);       // COMPARATOR 2 NEGATIVE HYSTERESIS 0

//  SCON0  0x98
SBIT (SM00, SFR_SCON0, 7);           // UART 0 MODE 0
SBIT (SM10, SFR_SCON0, 6);           // UART 0 MODE 1
SBIT (SM20, SFR_SCON0, 5);           // UART 0 MCE
SBIT (REN0, SFR_SCON0, 4);           // UART 0 RX ENABLE
SBIT (TB80, SFR_SCON0, 3);           // UART 0 TX BIT 8
SBIT (RB80, SFR_SCON0, 2);           // UART 0 RX BIT 8
SBIT (TI0, SFR_SCON0, 1);            // UART 0 TX INTERRUPT FLAG
SBIT (RI0, SFR_SCON0, 0);            // UART 0 RX INTERRUPT FLAG

//  SCON1  0x98
SBIT (S1MODE, SFR_SCON1, 7);         // UART 1 MODE
                                     // Bit6 unused
SBIT (MCE1, SFR_SCON1, 5);           // UART 1 MCE
SBIT (REN1, SFR_SCON1, 4);           // UART 1 RX ENABLE
SBIT (TB81, SFR_SCON1, 3);           // UART 1 TX BIT 8
SBIT (RB81, SFR_SCON1, 2);           // UART 1 RX BIT 8
SBIT (TI1, SFR_SCON1, 1);            // UART 1 TX INTERRUPT FLAG
SBIT (RI1, SFR_SCON1, 0);            // UART 1 RX INTERRUPT FLAG

//  IE  0xA8
SBIT (EA, SFR_IE, 7);                // GLOBAL INTERRUPT ENABLE
                                     // Bit6 unused
SBIT (ET2, SFR_IE, 5);               // TIMER 2 INTERRUPT ENABLE
SBIT (ES0, SFR_IE, 4);               // UART0 INTERRUPT ENABLE
SBIT (ET1, SFR_IE, 3);               // TIMER 1 INTERRUPT ENABLE
SBIT (EX1, SFR_IE, 2);               // EXTERNAL INTERRUPT 1 ENABLE
SBIT (ET0, SFR_IE, 1);               // TIMER 0 INTERRUPT ENABLE
SBIT (EX0, SFR_IE, 0);               // EXTERNAL INTERRUPT 0 ENABLE

//  IP  0xB8
                                     // Bit7 unused
                                     // Bit6 unused
SBIT (PT2, SFR_IP, 5);               // TIMER 2 PRIORITY
SBIT (PS0, SFR_IP, 4);                // SERIAL PORT PRIORITY
SBIT (PT1, SFR_IP, 3);               // TIMER 1 PRIORITY
SBIT (PX1, SFR_IP, 2);               // EXTERNAL INTERRUPT 1 PRIORITY
SBIT (PT0, SFR_IP, 1);               // TIMER 0 PRIORITY
SBIT (PX0, SFR_IP, 0);               // EXTERNAL INTERRUPT 0 PRIORITY

// SMB0CN 0xC0
SBIT (BUSY, SFR_SMB0CN, 7);          // SMBUS 0 BUSY
SBIT (ENSMB, SFR_SMB0CN, 6);         // SMBUS 0 ENABLE
SBIT (STA, SFR_SMB0CN, 5);           // SMBUS 0 START FLAG
SBIT (STO, SFR_SMB0CN, 4);           // SMBUS 0 STOP FLAG
SBIT (SI, SFR_SMB0CN, 3);            // SMBUS 0 INTERRUPT PENDING FLAG
SBIT (AA, SFR_SMB0CN, 2);            // SMBUS 0 ASSERT/ACKNOWLEDGE FLAG
SBIT (SMBFTE, SFR_SMB0CN, 1);        // SMBUS 0 FREE TIMER ENABLE
SBIT (SMBTOE, SFR_SMB0CN, 0);        // SMBUS 0 TIMEOUT ENABLE

// CAN0STA 0xC0
SBIT (BOFF, SFR_CAN0STA, 7);         // Bus Off Status
SBIT (EWARN, SFR_CAN0STA, 6);        // Warning Status
SBIT (EPASS, SFR_CAN0STA, 5);        // Error Passive
SBIT (RXOK, SFR_CAN0STA, 4);         // Received Message Successfully
SBIT (TXOK, SFR_CAN0STA, 3);         // Transmit a Message Successfully
SBIT (LEC2, SFR_CAN0STA, 2);         // Last error code bit 2
SBIT (LEC1, SFR_CAN0STA, 1);         // Last error code bit 1
SBIT (LEC0, SFR_CAN0STA, 0);         // Last error code bit

//  TMR2CN  0xC8
SBIT (TF2, SFR_TMR2CN, 7);           // TIMER 2 OVERFLOW FLAG
SBIT (EXF2, SFR_TMR2CN, 6);          // TIMER 2 EXTERNAL FLAG
                                     // Bit5 unused
                                     // Bit4 unused
SBIT (EXEN2, SFR_TMR2CN, 3);         // TIMER 2 EXTERNAL ENABLE FLAG
SBIT (TR2, SFR_TMR2CN, 2);           // TIMER 2 ON/OFF CONTROL
SBIT (CT2, SFR_TMR2CN, 1);           // TIMER 2 COUNTER SELECT
SBIT (CPRL2, SFR_TMR2CN, 0);         // TIMER 2 CAPTURE SELECT

